import 'package:auto_route/auto_route.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:vezem_zerno/core/constants/colors_constants.dart';

@RoutePage()
class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({super.key});

  final String privacyPolicyText = '''
Политика Конфиденциальности  
==============

Последнее обновление: 13 июля 2025 г.

В настоящей Политике конфиденциальности описываются наши политики и процедуры по сбору,
использование и раскрытие Вашей информации, когда Вы пользуетесь Сервисом, и сообщает Вам
о Ваших правах на конфиденциальность и о том, как закон защищает Вас.

Мы используем Ваши персональные данные для предоставления и улучшения Сервиса. Используя
Сервис, Вы соглашаетесь на сбор и использование информации в соответствии с
Эта Политика конфиденциальности.

Толкование и определения  
-----------------------------

Интерпретация  
~~~~~~~~~~~~~~

Слова, первая буква которых заглавная, имеют определённые значения.
При следующих условиях. Следующие определения имеют одинаковое значение.
значения независимо от того, стоят ли они в единственном или во множественном числе.

Определения  
~~~~~~~~~~~

Для целей настоящей Политики конфиденциальности:

  * Учетная запись означает уникальную учетную запись, созданную для того, чтобы Вы могли получить доступ к нашему Сервису или
    части нашего Сервиса.

  * Аффилированное лицо означает организацию, которая контролирует, контролируется или находится под контролем
    общий контроль со стороной, где «контроль» означает владение 50% или
    больше акций, долей участия или других ценных бумаг, имеющих право голоса
    для выборов директоров или иного управляющего органа.

  * Приложение относится к Везём Зерно, программе, предоставленной
    Компания.

  * Компания (далее именуемая «Компания», «Мы», «Нас» или «Наш»)
    Соглашение) относится к Везём Зерно.

  * Под страной понимается: Россия

  * Устройство означает любое устройство, которое может получить доступ к Сервису, например компьютер,
    мобильный телефон или цифровой планшет.

  * Персональные данные – это любая информация, которая относится к идентифицированному или
    идентифицируемое лицо.

  * Под услугой понимается Приложение.

  * Поставщик услуг означает любое физическое или юридическое лицо, которое обрабатывает данные.
    от имени Компании. Речь идёт о сторонних компаниях или
    лица, нанятые Компанией для содействия предоставлению Услуги, для предоставления
    Служба от имени Компании, для выполнения услуг, связанных с
    Сервиса или для оказания помощи Компании в анализе того, как используется Сервис.

  * Данные об использовании относятся к данным, которые собираются автоматически, либо генерируются
    использование Сервиса или самой инфраструктуры Сервиса (например,
    длительность посещения страницы).

  * Вы означает лицо, получающее доступ к Сервису или использующее его, или компанию,
    или другое юридическое лицо, от имени которого такое лицо осуществляет доступ или
    с использованием Сервиса, если применимо.


Сбор и использование ваших персональных данных  
---------------------------------------

Типы собираемых данных  
~~~~~~~~~~~~~~~~~~~~~~~

Персональные данные  
*************

При использовании Нашего Сервиса Мы можем попросить Вас предоставить Нам определенную персональную информацию
идентифицируемая информация, которая может быть использована для связи с Вами или Вашей идентификации.
Персональная информация может включать, помимо прочего:

  * Имя и фамилия

  * Номер телефона

  * Данные об использовании


Данные об использовании  
**********

Данные об использовании собираются автоматически при использовании Сервиса.

Данные об использовании могут включать в себя такую информацию, как интернет-протокол вашего устройства.
адрес (например, IP-адрес), тип браузера, версия браузера, страницы нашего
Сервис, который Вы посещаете, время и дата Вашего посещения, время, затраченное на
эти страницы, уникальные идентификаторы устройств и другие диагностические данные.

Когда вы получаете доступ к Сервису с помощью мобильного устройства, мы можем собирать
определенная информация автоматически, включая, помимо прочего, тип
Используемое Вами мобильное устройство, уникальный идентификатор Вашего мобильного устройства, IP-адрес Вашего
мобильное устройство, ваша мобильная операционная система, тип мобильного интернета
Используемый вами браузер, уникальные идентификаторы устройства и другие диагностические данные.

Мы также можем собирать информацию, которую Ваш браузер отправляет каждый раз, когда Вы посещаете наш
Сервис или когда Вы получаете доступ к Сервису с помощью мобильного устройства.

Информация, собранная при использовании приложения  
*************************************************

При использовании Нашего Приложения, в целях предоставления функций Нашего Приложения,
С Вашего предварительного разрешения мы можем собирать:

  * Информация о вашем местоположении

Мы используем эту информацию для предоставления функций нашего Сервиса, для его улучшения и
Персонализируйте наш сервис. Информация может быть загружена в систему компании.
серверах и/или сервере Поставщика услуг или он может просто храниться на Вашем
устройство.

Вы можете включить или отключить доступ к этой информации в любое время через Ваш
Настройки устройства.

Использование ваших персональных данных  
~~~~~~~~~~~~~~~~~~~~~~~~~

Компания может использовать Персональные данные в следующих целях:

  * Для предоставления и обслуживания нашего Сервиса, включая мониторинг использования
    наша Служба.

  * Для управления вашей учетной записью: для управления вашей регистрацией в качестве пользователя
    Сервис. Предоставляемые вами персональные данные могут дать вам доступ к различным
    Функциональные возможности Сервиса, доступные Вам как зарегистрированному пользователю
    пользователь.

  * Для исполнения контракта: разработка, соблюдение и
    обязательство по договору купли-продажи товаров, предметов или услуг
    Вы приобрели или заключили любой другой договор с Нами посредством Сервиса.

  * Чтобы связаться с Вами: чтобы связаться с Вами по электронной почте, телефону, SMS или другим способом
    эквивалентные формы электронной связи, такие как мобильная связь
    push-уведомления приложения об обновлениях или информативные
    сообщения, связанные с функциями, продуктами или контрактными
    услуги, включая обновления безопасности, когда это необходимо или разумно для
    их реализация.

  * Для предоставления Вам новостей, специальных предложений и общей информации о
    другие товары, услуги и мероприятия, которые мы предлагаем, аналогичные тем,
    которые вы уже приобрели или о которых спрашивали, если вы не выбрали
    не получать такую информацию.

  * Для управления Вашими запросами: Для рассмотрения и управления Вашими запросами к Нам.

  * Для деловых передач: мы можем использовать вашу информацию для оценки или проведения
    слияние, отчуждение, реструктуризация, реорганизация, роспуск или
    другая продажа или передача части или всех Наших активов, будь то в качестве действующего
    обеспокоенность или как часть банкротства, ликвидации или аналогичной процедуры, в
    какие персональные данные, хранящиеся у нас о пользователях наших Услуг, относятся к активам
    переведено.

  * Для других целей: Мы можем использовать Вашу информацию для других целей, таких как
    как анализ данных, выявление тенденций использования, определение эффективности
    наших рекламных кампаний, а также для оценки и улучшения нашего Сервиса,
    продукты, услуги, маркетинг и ваш опыт.


Мы можем передавать Ваши персональные данные в следующих ситуациях:

  * Поставщикам услуг: мы можем передавать вашу личную информацию
    Поставщики услуг для мониторинга и анализа использования нашего Сервиса,
    связаться с Вами.
  * Для деловых передач: мы можем передавать или делиться вашей личной информацией
    в связи с любым слиянием, продажей Компании или во время переговоров о них
    активов, финансирования или приобретения всего или части нашего бизнеса для
    другая компания.
  * С аффилированными лицами: Мы можем делиться Вашей информацией с нашими аффилированными лицами, в
    в этом случае мы потребуем от этих аффилированных лиц соблюдать настоящую Политику конфиденциальности.
    Аффилированные лица включают нашу материнскую компанию и любые другие дочерние компании, совместные предприятия
    Партнеры по венчурному бизнесу или другие компании, которые мы контролируем или которые находятся под нашим контролем
    общий контроль с Нами.
  * С деловыми партнерами: Мы можем делиться Вашей информацией с Нашим бизнесом
    партнеров для предложения Вам определенных продуктов, услуг или акций.
  * С другими пользователями: когда Вы делитесь личной информацией или иным образом
    взаимодействуете в общественных зонах с другими пользователями, такая информация может быть
    просматриваются всеми пользователями и могут публично распространяться за пределами.
  * С Вашего согласия: Мы можем раскрыть Вашу личную информацию для любых целей.
    других целей с Вашего согласия.

Хранение ваших персональных данных  
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Компания будет хранить Ваши персональные данные только в течение необходимого времени.
Для целей, изложенных в настоящей Политике конфиденциальности. Мы будем хранить и использовать ваши данные.
Персональные данные в объеме, необходимом для выполнения наших юридических обязательств
(например, если нам необходимо сохранить ваши данные для соблюдения применимых
законы), разрешать споры и обеспечивать соблюдение наших юридических соглашений и политик.

Компания также будет сохранять данные об использовании для целей внутреннего анализа.
Данные обычно сохраняются в течение более короткого периода времени, за исключением случаев, когда эти данные
используется для усиления безопасности или улучшения функциональности Нашего
Сервис, или мы юридически обязаны хранить эти данные в течение более длительного времени
периоды.

Передача ваших персональных данных  
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Ваша информация, включая персональные данные, обрабатывается в Компании
операционных офисах и в любых других местах, где стороны, участвующие в
Обработка данных локализована. Это означает, что эта информация может быть передана —
и поддерживается на — компьютерах, расположенных за пределами вашего штата, провинции, страны
или другой правительственной юрисдикции, где законы о защите данных могут отличаться
чем те, которые находятся в Вашей юрисдикции.

Ваше согласие с настоящей Политикой конфиденциальности с последующим предоставлением Вами такой информации
информация представляет собой Ваше согласие на такую передачу.

Компания предпримет все разумно необходимые шаги для обеспечения сохранности Ваших данных.
обрабатывается безопасно и в соответствии с настоящей Политикой конфиденциальности и не передается
Ваших персональных данных будут переданы организации или стране, если
имеются адекватные средства контроля, включая безопасность Ваших данных и
прочая личная информация.

Удалить ваши персональные данные  
~~~~~~~~~~~~~~~~~~~~~~~~~

У вас есть право удалить или попросить нас помочь в удалении
Персональные данные, которые мы собрали о вас.

Наш Сервис может предоставить Вам возможность удалить определенную информацию о Вас.
изнутри Сервиса.

Вы можете обновить, изменить или удалить свою информацию в любое время, войдя в систему
Ваша учетная запись, если она у вас есть, и посещение раздела настроек учетной записи, который
позволяет вам управлять вашей личной информацией. Вы также можете связаться с нами, чтобы
запросить доступ, исправить или удалить любую личную информацию, которая у вас есть
предоставлено Нам.

Однако обратите внимание, что нам может потребоваться сохранить определенную информацию, когда мы
иметь юридическое обязательство или законное основание для этого.

Раскрытие ваших персональных данных  
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Деловые операции  
*********************

Если компания участвует в слиянии, поглощении или продаже активов, Ваш
Персональные данные могут быть переданы. Мы сообщим об этом заранее.
Данные передаются и становятся предметом другой Политики конфиденциальности.

Правоохранительные органы  
***************

При определенных обстоятельствах Компания может быть обязана раскрыть Вашу
Персональные данные, если это требуется по закону или в ответ на обоснованные запросы
государственные органы (например, суд или правительственное учреждение).

Другие юридические требования  
************************

Компания может раскрыть Ваши персональные данные, добросовестно полагая, что такие данные
необходимо принять меры для:

  * Соблюдать юридические обязательства
  * Защищать и отстаивать права и собственность Компании
  * Предотвращать или расследовать возможные правонарушения, связанные с Сервисом
  * Защитить личную безопасность Пользователей Сервиса или общественности
  * Защита от юридической ответственности

Безопасность ваших персональных данных  
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Безопасность Ваших персональных данных важна для нас, но помните, что нет
метод передачи через Интернет или метод электронного хранения
100% безопасно. Мы стремимся использовать коммерчески приемлемые средства защиты.
Ваши персональные данные. Мы не можем гарантировать их абсолютную безопасность.

Конфиденциальность детей  
------------------

Наш Сервис не предназначен для лиц младше 13 лет. Мы сознательно не
собирать персональные данные лиц младше 13 лет.
Если Вы являетесь родителем или опекуном и Вам известно, что Ваш ребенок предоставил
Если у нас есть персональные данные, пожалуйста, свяжитесь с нами. Если нам станет известно, что у нас есть
собирал персональные данные лиц младше 13 лет без проверки
родительского согласия, Мы предпринимаем шаги, чтобы удалить эту информацию из Нашего
серверы.

Если нам необходимо полагаться на согласие как на правовое основание для обработки вашей информации
и в вашей стране требуется согласие родителя, мы можем потребовать согласие вашего родителя
согласие, прежде чем мы соберем и используем эту информацию.

Ссылки на другие сайты  
-----------------------

Наш Сервис может содержать ссылки на другие веб-сайты, которые не управляются Нами.
Если вы нажмете на ссылку третьей стороны, вы будете перенаправлены на сайт этой третьей стороны.
Мы настоятельно рекомендуем вам ознакомиться с Политикой конфиденциальности каждого сайта, который вы посещаете.
посещать.

Мы не контролируем и не несем ответственности за содержание, конфиденциальность
политики или практики любых сторонних сайтов или служб.

Изменения в настоящей Политике конфиденциальности  
-----------------------------

Мы можем время от времени обновлять нашу Политику конфиденциальности. Мы уведомим вас о любых изменениях.
изменения путем публикации новой Политики конфиденциальности на этой странице.

Мы сообщим Вам об этом по электронной почте и/или с помощью заметного объявления в Нашем Сервисе заранее.
чтобы изменения вступили в силу, и обновите дату «Последнего обновления» вверху
настоящей Политики конфиденциальности.

Рекомендуется периодически просматривать настоящую Политику конфиденциальности на предмет каких-либо изменений.
Изменения в настоящей Политике конфиденциальности вступают в силу с момента их публикации на этом сайте.
страница.

Связаться с нами  
----------

Если у вас есть какие-либо вопросы по настоящей Политике конфиденциальности, вы можете связаться с нами:

  * По электронной почте: thekuznet@gmail.com


''';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        surfaceTintColor: Colors.transparent,
        backgroundColor: ColorsConstants.backgroundColor,
        leading: IconButton(
          icon: const Icon(Icons.arrow_back),
          color: ColorsConstants.primaryBrownColor,
          iconSize: 30.r,
          onPressed: () => AutoRouter.of(context).back(),
        ),
      ),
      backgroundColor: ColorsConstants.backgroundColor,
      body: SafeArea(
        child: SingleChildScrollView(
          padding: EdgeInsets.all(16.r),
          child: Text(
            privacyPolicyText,
            style: TextStyle(
              fontSize: 16.sp,
              height: 1.5,
              color: ColorsConstants.primaryBrownColor,
            ),
          ),
        ),
      ),
    );
  }
}
